app/controllers/contestants_controller.rb

  def index
    @contestants = Contestant.all

    if @contestants.count > 2
      first_id = @contestants.first.id
      last_id = @contestants.last.id
      winner = rand(first_id..last_id)
      @winner = Contestant.find(winner)
---
SELECT "contestants".* FROM "contestants"
SELECT "contestants".* FROM "contestants" WHERE "contestants"."id" = $1 LIMIT 1  [["id", 3]]

  def show
    @contestant = Contestant.find(params[:id])
---
SELECT "contestants".* FROM "contestants" WHERE "contestants"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @contestant = Contestant.find(params[:id])
---
SELECT "contestants".* FROM "contestants" WHERE "contestants"."id" = $1 LIMIT 1  [["id", "19"]]

  def create
    @contestant = Contestant.new(params[:contestant])

    respond_to do |format|

      if verify_recaptcha(:model => @contestant, :message => "Oh! It's error with reCAPTCHA!") && @contestant.save
---
INSERT INTO "contestants" ("age", "city", "country", "created_at", "email", "first_name", "gender", "last_name", "newsletter", "phone", "rules", "state", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def update
    @contestant = Contestant.find(params[:id])
---
SELECT "contestants".* FROM "contestants" WHERE "contestants"."id" = $1 LIMIT 1  [["id", "19"]]